app/views/users/edit.html.erb

<p>Edit games you are currently interested in:
<%= f.collection_check_boxes :game_ids, Game.all, :id, :name %>
---
SELECT "games".* FROM "games"