app/views/users/show.html.erb

  <ul>
    <% @user.games.map do |game|  %>
---
SELECT "games".* FROM "games" INNER JOIN "user_games" ON "games"."id" = "user_games"."game_id" WHERE "user_games"."user_id" = ?  [["user_id", 3]]