app/views/users/show.html.erb

<ul>
  <% @user.games.map do |game|  %>
---
SELECT "games".* FROM "games" INNER JOIN "user_games" ON "games"."id" = "user_games"."game_id" WHERE "user_games"."user_id" = ?  [["user_id", 2]]

<ul>
  <% @user.tournaments.map do |tournament|  %>
---
SELECT "tournaments".* FROM "tournaments" INNER JOIN "user_tournaments" ON "tournaments"."id" = "user_tournaments"."tournament_id" WHERE "user_tournaments"."user_id" = ?  [["user_id", 2]]