app/views/tournaments/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "user_tournaments" ON "users"."id" = "user_tournaments"."user_id" WHERE "user_tournaments"."tournament_id" = ?  [["tournament_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "user_tournaments" ON "users"."id" = "user_tournaments"."user_id" WHERE "user_tournaments"."tournament_id" = ?  [["tournament_id", 1]]
---

<p>There are currently <%= @tournament.users.count %> players signed up for this tournament. </p>
<ul>
  <% @tournament.users.each do |user| %>

SELECT "tournaments".* FROM "tournaments" INNER JOIN "user_tournaments" ON "tournaments"."id" = "user_tournaments"."tournament_id" WHERE "user_tournaments"."user_id" = ?  [["user_id", 1]]
---

  <% current_user.tournaments.each do |tournament| %>