app/views/games/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "user_games" ON "users"."id" = "user_games"."user_id" WHERE "user_games"."game_id" = ?  [["game_id", 3]]
---
  <ul>
    <% @game.users.each do |user| %>