app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def current_user
    # Look up the current user based on user_id in the session cookie:
    @current_user ||= User.find(session[:user_id]) if session[:user_id]

SELECT "tournaments".* FROM "tournaments"
---
  def tournament_dates
    @tournaments = Tournament.all.map {|t| t.date }.uniq