app/controllers/application_controller.rb

  def tournament_dates
    @tournaments = Tournament.all.map {|t| t.date }.uniq
---
SELECT "tournaments".* FROM "tournaments"