app/controllers/pages_controller.rb

SELECT  "tournaments".* FROM "tournaments" ORDER BY "tournaments"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def home
    @tournaments = Tournament.all
    @game = Game.find(1)