app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def index
    @tournaments = Tournament.all

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def class_finder
    @tournament = Tournament.find(params[:id])