app/controllers/user_tournaments_controller.rb

INSERT INTO "user_tournaments" ("user_id", "tournament_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["tournament_id", 8], ["created_at", "2018-10-25 10:54:08.665627"], ["updated_at", "2018-10-25 10:54:08.665627"]]
---
  def create
    @user_tournament = UserTournament.create(class_params)