app/controllers/users_controller.rb

  def create
    @user = User.new(class_params)
    # stores all emails in lowercase to avoid duplicates and case-sensitive login errors:
    @user.email.downcase!
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    authorized_for(params[:id])
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def update
    if @user.update(class_params)
---
UPDATE "users" SET "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["bio", "I am a legend amongst men."], ["updated_at", "2018-10-25 18:09:34.674859"], ["id", 2]]

  def class_finder
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]